cask_args appdir: "/Applications", require_sha: true

# Almacenamiento
cask "Dropbox"
cask "google-backup-and-sync"

# Comms
cask "telegram-desktop"
cask "whatsapp"
cask "slack"

# Otros
cask "1password"
cask "workflowy"
cask "notion"
cask "niftyman" # Beautifully crafted Notion experience in MacOS menu bar!
cask "android-file-transfer"
cask "visual-studio-code"
cask "dbeaver-community" # Universal database tool and SQL client
cask "sublime-text"
cask "appcleaner"
cask "authy" # 2FA
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "jupyter-notebook-viewer"
#cask "nteract"
cask "karabiner-elements" # Keyboard customizer
cask "The Unarchiver"
cask "keka"
cask "numi" # Calculator and converter application
cask "mounty" # Re-mounts write-protected NTFS volumes
#cask "miniconda"
cask "timemachineeditor" # Utility to change the default backup interval of Time Machine
cask "textbuddy" # Convert, filter, sort, and transform text
cask "zotero" # Collect, organize, cite, and share research sources
#cask "syncthing"

# multimedia
cask "kid3" # Audio tagger focusing on efficiency
cask "spotify"
cask "vox" # Music player
cask "soulseek"
cask "xld"
cask "iina" # Multimedia player
cask "roon"
cask "transmission-remote-gui"
cask "transmission"
cask "notunes" # Evitar que se abra la app de musica de mac os
#cask "plug" # Music player for The Hype Machine

# OS management tools
cask "rectangle" # Move and resize windows using keyboard shortcuts or snap areas
cask "aldente" # Menu bar tool to limit maximum charging percentage
#cask "hocus-focus"

#cask "pock" # Utility to display the Dock in the Touch Bar
#cask "amethyst" # Automatic tiling window manager similar to xmonad
#cask "nightowl" # Utility to toggle dark mode

# Infosec
cask "lulu" # Open-source firewall to block unknown outgoing connections
cask "oversight" # Monitors computer mic and webcam
cask "reikey" # Scans, detects, and monitors keyboard taps
#cask "blockblock" # Monitors common persistence locations
#cask "knockknock" # Tool to show what is persistently installed on the computer
