cask_args appdir: "/Applications", require_sha: true

# taps
tap "homebrew/cask-fonts"
tap "nikitabobko/tap/aerospace"

# fonts
cask "font-cascadia-code"
cask "font-cascadia-mono"
#cask "font-cascadia-mono-pl"
cask "font-fira-code"
cask "font-hack-nerd-font"


########################
###### Comms #########
cask "telegram-desktop"
cask "whatsapp"
#cask "slack"


###############################
####### MacOS related #########
cask "rectangle" # Move and resize windows using keyboard shortcuts or snap areas
cask "aerospace" # AeroSpace is an i3-like tiling window manager for macOS
cask "monitorcontrol" # Tool to control external monitor brightness & volume
cask "nightfall" # Utility to toggle dark mode
cask "hiddenbar" # Hidden Bar lets you hide menu bar items to give your Mac a cleaner look.
cask "bluesnooze" # Prevents your sleeping computer from connecting to Bluetooth accessories
#cask "aldente" # Menu bar tool to limit maximum charging percentage
#cask "betterdisplay"
#cask "hocus-focus"
#cask "pock" # Utility to display the Dock in the Touch Bar
#cask "amethyst" # Automatic tiling window manager similar to xmonad
#cask "deskreen" # Turns any device with a web browser into a secondary screen
#cask "hammerspoon" # desktop automation tool for macOS with Lua scripts
#cask "keepingyouawake" # Prevents your Mac from going to sleep

########################
##### multimedia #######
cask "kid3" # Audio tagger focusing on efficiency
cask "spotify"
cask "tidal"
cask "vox" # Music player
cask "soulseek" # File sharing network
cask "xld" # Lossless audio decoder
cask "iina" # Multimedia player
cask "roon" # THE ULTIMATE Music PLAYER FOR MUSIC FANATICS
cask "transmission" # Open-source BitTorrent client
cask "transmission-remote-gui"
cask "notunes" # Evitar que se abra la app de musica de mac os
#cask "plug" # Music player for The Hype Machine
#cask "handbrake" # Open-source video transcoder


########################
###### de todo #########
cask "google-drive"
cask "obsidian"
cask "android-file-transfer" # Transfer files from and to an Android smartphone
cask "sublime-text" # Text editor for code, markup and prose
cask "zotero" # Collect, organise, cite, and share research sources
cask "appcleaner" # Application uninstaller
cask "brave-browser"
cask "arc"
cask "syntax-highlight" # Quicklook extension for source files
cask "jupyter-notebook-viewer"
cask "karabiner-elements" # Keyboard customizer
cask "keka" # File archiver
cask "numi" # Calculator and converter application
cask "mounty" # Re-mounts write-protected NTFS volumes
cask "timemachineeditor" # Utility to change the default backup interval of Time Machine
cask "flameshot" # Screenshot software
cask "prusaslicer" 
cask "zotero" # Collect, organize, cite, and share research sources
cask "warp" # warp terminal
cask "ghostty" # ghostty terminal
cask "qlmarkdown" # Quick Look generator for Markdown files
cask "suspicious-package" # Application for inspecting installer packages
cask "syntax-highlight" # Quicklook extension for source files
#cask "dash" # API documentation browser and code snippet manager
#cask "iterm2" # Terminal emulator as alternative to Apple's Terminal app
#cask "the-unarchiver" # Unpacks archive files
#cask "bbedit" # Text, code, and markup editor
#cask "textbuddy" # Convert, filter, sort, and transform text
#cask "workflowy" # Notetaking tool
#cask "nteract" # Interactive computing suite
#cask "syncthing" # Open source continuous file synchronization application
#cask "texstudio"

########################
###### infosec #########
#cask "1password" # Password manager that keeps all passwords secure behind one password
#cask "authy" # 2FA
#cask "lulu" # Open-source firewall to block unknown outgoing connections
#cask "oversight" # Monitors computer mic and webcam
#cask "reikey" # Scans, detects, and monitors keyboard taps
#cask "blockblock" # Monitors common persistence locations
#cask "knockknock" # Tool to show what is persistently installed on the computer
