#tap "homebrew/bundle"
#tap "homebrew/cask"
#tap "homebrew/core"
tap "tw93/tap"

# CLI

brew "git"
brew "zsh"
brew "gh"
brew "uv"
brew "zellij" # Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "tmux" # Terminal multiplexer
brew "tldr" # Simplified and community-driven man pages
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "stow" # Organize software neatly under a single directory tree
brew "nnn" # Tiny, lightning fast, feature-packed file manager
brew "z" # Tracks most-used directories to make cd smarter
brew "speedtest-cli"
brew "hyfetch" # Fast, highly customisable system info script with LGBTQ+ pride flags
brew "htop" # Improved top (interactive process viewer)
brew "asitop" # Performance monitoring CLI tool for Apple Silicon
brew "mactop" # Apple Silicon Monitor Top written in Go Lang
brew "btop" # Resource monitor. C++ version and continuation of bashtop and bpytop
brew "mole" # Deep clean and optimize your Mac
brew "eza" # Modern, maintained replacement for ls
brew "mas" # Mac App Store command-line interface
brew "rclone" # Rsync for cloud storage
brew "micro" # editor nano like
brew "delta" # A syntax-highlighting pager for git, diff, grep, and blame output

#brew "diff-so-fancy" # Disk Usage/Free Utility (Linux, BSD, macOS & Windows) 
#brew "duf" # Disk Usage/Free Utility (Linux, BSD, macOS & Windows) 
#brew "gitmoji" # Interactive command-line tool for using emoji in commit messages

