cask_args appdir: "/Applications", require_sha: true

# Almacenamiento
cask "Dropbox"
cask "google-drive"

# Comms
cask "telegram-desktop"
cask "whatsapp"
cask "slack"

# OS management tools
cask "rectangle" # Move and resize windows using keyboard shortcuts or snap areas
cask "aldente" # Menu bar tool to limit maximum charging percentage
cask "betterdisplay"
#cask "hocus-focus"
#cask "pock" # Utility to display the Dock in the Touch Bar
#cask "amethyst" # Automatic tiling window manager similar to xmonad
cask "nightowl" # Utility to toggle dark mode
cask "deskreen" # Turns any device with a web browser into a secondary screen
cask "maccy" # Clipboard manager


# multimedia
cask "kid3" # Audio tagger focusing on efficiency
cask "spotify"
cask "vox" # Music player
cask "soulseek" # File sharing network
cask "xld" # Lossless audio decoder
cask "iina" # Multimedia player
cask "roon" # THE ULTIMATE Music PLAYER FOR MUSIC FANATICS
cask "transmission" # Open-source BitTorrent client
cask "transmission-remote-gui"
cask "notunes" # Evitar que se abra la app de musica de mac os
#cask "plug" # Music player for The Hype Machine
#cask "handbrake" # Open-source video transcoder


# De todo
cask "android-file-transfer" # Transfer files from and to an Android smartphone
cask "dbeaver-community" # Universal database tool and SQL client
cask "sublime-text" # Text editor for code, markup and prose
cask "bbedit" # Text, code, and markup editor
cask "appcleaner" # Application uninstaller
cask "dash" # API documentation browser and code snippet manager
cask "firefox"
Cask "brave-browser"
cask "google-chrome"
cask "iterm2" # Terminal emulator as alternative to Apple's Terminal app
cask "jupyter-notebook-viewer"
cask "karabiner-elements" # Keyboard customizer
cask "the-unarchiver" # Unpacks archive files
cask "keka" # File archiver
cask "numi" # Calculator and converter application
cask "mounty" # Re-mounts write-protected NTFS volumes
cask "timemachineeditor" # Utility to change the default backup interval of Time Machine
cask "textbuddy" # Convert, filter, sort, and transform text
cask "workflowy" # Notetaking tool
cask "notion" # App to write, plan, collaborate, and get organized
cask "niftyman" # Beautifully crafted Notion experience in MacOS menu bar!
cask "zotero" # Collect, organize, cite, and share research sources
cask "prusaslicer" 
#cask "notion-enhanced" # Enhancer/customiser for the all-in-one productivity workspace notion.so
#cask "nteract" # Interactive computing suite
#cask "syncthing" # Open source continuous file synchronization application
#cask "texstudio"

# infosec
#cask "1password" # Password manager that keeps all passwords secure behind one password
#cask "authy" # 2FA
#cask "lulu" # Open-source firewall to block unknown outgoing connections
#cask "oversight" # Monitors computer mic and webcam
#cask "reikey" # Scans, detects, and monitors keyboard taps
#cask "blockblock" # Monitors common persistence locations
#cask "knockknock" # Tool to show what is persistently installed on the computer
